TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_shaw__include
#define ti_devices_msp_peripherals_hw_shaw__include

/* This preliminary header file does not have a version number */
/* Filename: hw_shaw.h */
/* MMR revised: 2025-04-09 14:12:34 */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/m33c1 */
/* MMR revision: f4602b816b1643a266cc7aae6be755d35f394359 */
/* Generator revision: ee5e56ed8e50e22306abbffa1ce64d23abbf32b9
   (MInT: 1818019a64e181dbbfd48fdc69fea15367af4c13) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* SHAW Registers
******************************************************************************/
#define SHAW_SHAW_OFS                            ((uint32_t)0x00001000U)
#define SHAW_GPRCM_OFS                           ((uint32_t)0x00000800U)


/** @addtogroup SHAW_SHAW
  @{
*/

typedef struct {
       uint32_t RESERVED0[8];
  union {
      __IO uint32_t SHAW_PUB0_IIDX;                    /* !< PUB0 IIDX register */
      __IO uint32_t SHAW_PUB0_IIDX_SHAW_PUB0_IIDX_1;   /* !< PUB0 IIDX register */
  };
  union {
      __IO uint32_t Reserved_2;
      __IO uint32_t Reserved_2_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB0_IMASK;                   /* !< PUB0 IMASK register */
      __IO uint32_t SHAW_PUB0_IMASK_SHAW_PUB0_IMASK_1; /* !< PUB0 IMASK register */
  };
  union {
      __IO uint32_t Reserved_3;
      __IO uint32_t Reserved_3_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB0_RIS;                     /* !< PUB0 RIS register */
      __IO uint32_t SHAW_PUB0_RIS_SHAW_PUB0_RIS_1;     /* !< PUB0 RIS register */
  };
  union {
      __IO uint32_t Reserved_4;
      __IO uint32_t Reserved_4_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB0_MIS;                     /* !< PUB0 MIS register */
      __IO uint32_t SHAW_PUB0_MIS_SHAW_PUB0_MIS_1;     /* !< PUB0 MIS register */
  };
  union {
      __IO uint32_t Reserved_5;
      __IO uint32_t Reserved_5_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB0_ISET;                    /* !< PUB0 ISET register */
      __IO uint32_t SHAW_PUB0_ISET_SHAW_PUB0_ISET_1;   /* !< PUB0 ISET register */
  };
  union {
      __IO uint32_t Reserved_6;
      __IO uint32_t Reserved_6_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB0_ICLR;                    /* !< PUB0 ICLR register */
      __IO uint32_t SHAW_PUB0_ICLR_SHAW_PUB0_ICLR_1;   /* !< PUB0 ICLR register */
  };
  union {
      __IO uint32_t Reserved_7;
      __IO uint32_t Reserved_7_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_IIDX;                    /* !< PUB1 IIDX register */
      __IO uint32_t SHAW_PUB1_IIDX_SHAW_PUB1_IIDX_1;   /* !< PUB1 IIDX register */
  };
  union {
      __IO uint32_t Reserved_8;
      __IO uint32_t Reserved_8_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_IMASK;                   /* !< PUB1 IIDX register */
      __IO uint32_t SHAW_PUB1_IMASK_SHAW_PUB1_IMASK_1; /* !< PUB1 IIDX register */
  };
  union {
      __IO uint32_t Reserved_9;
      __IO uint32_t Reserved_9_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_RIS;                     /* !< PUB1 RIS register */
      __IO uint32_t SHAW_PUB1_RIS_SHAW_PUB1_RIS_1;     /* !< PUB1 RIS register */
  };
  union {
      __IO uint32_t Reserved_10;
      __IO uint32_t Reserved_10_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_MIS;                     /* !< PUB1 MIS register */
      __IO uint32_t SHAW_PUB1_MIS_SHAW_PUB1_MIS_1;     /* !< PUB1 MIS register */
  };
  union {
      __IO uint32_t Reserved_11;
      __IO uint32_t Reserved_11_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_ISET;                    /* !< PUB1 ISET register */
      __IO uint32_t SHAW_PUB1_ISET_SHAW_PUB1_ISET_1;   /* !< PUB1 ISET register */
  };
  union {
      __IO uint32_t Reserved_12;
      __IO uint32_t Reserved_12_SHAW_PUB1_ISET_1;
  };
  union {
      __IO uint32_t SHAW_PUB1_ICLR;                    /* !< PUB1 ICLR register */
      __IO uint32_t SHAW_PUB1_ICLR_SHAW_PUB1_ICLR_1;   /* !< PUB1 ICLR register */
  };
  union {
      __IO uint32_t Reserved_13;
      __IO uint32_t Reserved_13_Reserved_1;
  };
  union {
      __IO uint32_t SHAW_DMA_START_TRIGGER;            /* !< DMA Start Trigger Register */
      __IO uint32_t SHAW_DMA_START_TRIGGER_SHAW_DMA_START_TRIGGER_1;/* !< DMA Start Trigger Register */
  };
  union {
      __IO uint32_t Reserved_14[31];
      __IO uint32_t Reserved_14_Reserved_1[31];
  };
  union {
      __IO uint32_t SHAW_DATA_FIXED;                   /* !< Fixed Address Wrie Register */
      __IO uint32_t SHAW_DATA_FIXED_SHAW_DATA_FIXED_1; /* !< Fixed Address Wrie Register */
  };
  union {
      __IO uint32_t Reserved_15[63];
      __IO uint32_t Reserved_15_Reserved_1[63];
  };
  union {
      __IO uint32_t EIP59_DATA_IN0_;                   /* !< SHA Data IN 0 register */
      __IO uint32_t EIP59_DATA_IN0__EIP59_DATA_IN0_1;  /* !< SHA Data IN 0 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN1_;                   /* !< SHA Data IN 1 register */
      __IO uint32_t EIP59_DATA_IN1__EIP59_DATA_IN1_1;  /* !< SHA Data IN 1 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN2_;                   /* !< SHA Data IN 2 register */
      __IO uint32_t EIP59_DATA_IN2__EIP59_DATA_IN2_1;  /* !< SHA Data IN 2 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN3_;                   /* !< SHA Data IN 3 register */
      __IO uint32_t EIP59_DATA_IN3__EIP59_DATA_IN3_1;  /* !< SHA Data IN 3 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN4_;                   /* !< SHA Data IN 4 register */
      __IO uint32_t EIP59_DATA_IN4__EIP59_DATA_IN4_1;  /* !< SHA Data IN 4 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN5_;                   /* !< SHA Data IN 5 register */
      __IO uint32_t EIP59_DATA_IN5__EIP59_DATA_IN5_1;  /* !< SHA Data IN 5 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN6_;                   /* !< SHA Data IN 6 register */
      __IO uint32_t EIP59_DATA_IN6__EIP59_DATA_IN6_1;  /* !< SHA Data IN 6 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN7_;                   /* !< SHA Data IN 7 register */
      __IO uint32_t EIP59_DATA_IN7__EIP59_DATA_IN7_1;  /* !< SHA Data IN 7 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN8_;                   /* !< SHA Data IN 8 register */
      __IO uint32_t EIP59_DATA_IN8__EIP59_DATA_IN8_1;  /* !< SHA Data IN 8 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN9_;                   /* !< SHA Data IN 9 register */
      __IO uint32_t EIP59_DATA_IN9__EIP59_DATA_IN9_1;  /* !< SHA Data IN 9 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN10_;                  /* !< SHA Data IN 10 register */
      __IO uint32_t EIP59_DATA_IN10__EIP59_DATA_IN10_1;/* !< SHA Data IN 10 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN11_;                  /* !< SHA Data IN 11 register */
      __IO uint32_t EIP59_DATA_IN11__EIP59_DATA_IN11_1;/* !< SHA Data IN 11 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN12_;                  /* !< SHA Data IN 12 register */
      __IO uint32_t EIP59_DATA_IN12__EIP59_DATA_IN12_1;/* !< SHA Data IN 12 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN13_;                  /* !< SHA Data IN 13 register */
      __IO uint32_t EIP59_DATA_IN13__EIP59_DATA_IN13_1;/* !< SHA Data IN 13 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN14_;                  /* !< SHA Data IN 14 register */
      __IO uint32_t EIP59_DATA_IN14__EIP59_DATA_IN14_1;/* !< SHA Data IN 14 register */
  };
  union {
      __IO uint32_t EIP59_DATA_IN15_;                  /* !< SHA Data IN 15 register */
      __IO uint32_t EIP59_DATA_IN15__EIP59_DATA_IN15_1;/* !< SHA Data IN 15 register */
  };
  union {
      __IO uint32_t EIP59_IO_BUF_CTRL_STAT;            /* !< SHA Status Register */
      __IO uint32_t EIP59_IO_BUF_CTRL_STAT_EIP59_IOBUF_CTRL_STAT_1;/* !< SHA Status Register */
  };
  union {
      __IO uint32_t EIP59_MODE_IN;                     /* !< SHA Mode Register */
      __IO uint32_t EIP59_MODE_IN_EIP59_MODE_IN_1;     /* !< SHA Mode Register */
  };
  union {
      __IO uint32_t EIP59_LENGTH_IN_L;                 /* !< Data Length Register LSB */
      __IO uint32_t EIP59_LENGTH_IN_L_EIP59_LENGTH_IN_L_1;/* !< Data Length Register LSB */
  };
  union {
      __IO uint32_t EIP59_LENGTH_IN_H;                 /* !< Data Length Register MSB */
      __IO uint32_t EIP59_LENGTH_IN_H_EIP59_LENGTH_IN_H_1;/* !< Data Length Register MSB */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_A;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_A_EIP59_IDIGEST_A_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_B;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_B_EIP59_IDIGEST_B_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_C;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_C_EIP59_IDIGEST_C_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_D;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_D_EIP59_IDIGEST_D_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_E;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_E_EIP59_IDIGEST_E_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_F;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_F_EIP59_IDIGEST_F_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_G;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_G_EIP59_IDIGEST_G_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_IDIGEST_H;                   /* !< SHA IDIGEST Register */
      __IO uint32_t EIP59_IDIGEST_H_EIP59_IDIGEST_H_1; /* !< SHA IDIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_A;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_A_EIP59_ODIGEST_A_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_B;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_B_EIP59_ODIGEST_B_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_C;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_C_EIP59_ODIGEST_C_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_D;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_D_EIP59_ODIGEST_D_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_E;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_E_EIP59_ODIGEST_E_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_F;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_F_EIP59_ODIGEST_F_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_G;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_G_EIP59_ODIGEST_G_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_ODIGEST_H;                   /* !< SHA ODIGEST Register */
      __IO uint32_t EIP59_ODIGEST_H_EIP59_ODIGEST_H_1; /* !< SHA ODIGEST Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_A;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_A_EIP59_DIGEST_A_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_B;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_B_EIP59_DIGEST_B_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_C;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_C_EIP59_DIGEST_C_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_D;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_D_EIP59_DIGEST_D_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_E;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_E_EIP59_DIGEST_E_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_F;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_F_EIP59_DIGEST_F_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_G;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_G_EIP59_DIGEST_G_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t EIP59_DIGEST_H;                    /* !< SHA DIGEST OUT Result Register */
      __IO uint32_t EIP59_DIGEST_H_EIP59_DIGEST_H_1;   /* !< SHA DIGEST OUT Result Register */
  };
  union {
      __IO uint32_t Reserved_16[18];
      __IO uint32_t Reserved_16_Reserved_1[18];
  };
  union {
      __IO uint32_t EIP59_CONFIG;                      /* !< SHA Configuration Register */
      __IO uint32_t EIP59_CONFIG_EIP59_CONFIG_1;       /* !< SHA Configuration Register */
  };
  union {
      __IO uint32_t EIP59_VERSION;                     /* !< SHA Version Register */
      __IO uint32_t EIP59_VERSION_EIP59_VERSION_1;     /* !< SHA Version Register */
  };
  union {
      __IO uint32_t Reserved_17[832];
      __IO uint32_t Reserved_17_Reserved_1[832];
  };
} SHAW_SHAW_Regs;

/*@}*/ /* end of group SHAW_SHAW */

/** @addtogroup SHAW_GPRCM
  @{
*/

