TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} SHAW_GPRCM_Regs;

/*@}*/ /* end of group SHAW_GPRCM */

/** @addtogroup SHAW
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  SHAW_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[506];
  SHAW_SHAW_Regs  SHAW;                              /* !< (@ 0x00001000) */
} SHAW_Regs;

/*@}*/ /* end of group SHAW */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* SHAW Register Control Bits
******************************************************************************/

/* SHAW_SHAW_PUB0_IIDX Bits */
/* SHAW_SHAW_PUB0_IIDX[STAT] Bits */
#define SHAW_SHAW_PUB0_IIDX_STAT_OFS             (0)                             /* !< STAT Offset */
#define SHAW_SHAW_PUB0_IIDX_STAT_MASK            ((uint32_t)0x00000001U)         /* !< This register provides the highest
                                                                                    priority enabled interrupt index.
                                                                                    Value 0x00 means no event pending.
                                                                                    Interrupt 1 is the highest priority,
                                                                                    IIDX next highest, 4, 8, ... IIDX^31
                                                                                    is the least priority. That is, the
                                                                                    least bit position that is set to 1
                                                                                    denotes the highest priority pending
                                                                                    interrupt. The priority order is
                                                                                    fixed. However, users can implement
                                                                                    their own prioritization schemes
                                                                                    using other registers that expose the
                                                                                    full set of interrupts that have
                                                                                    occurred. On each read, only one
                                                                                    interrupt is indicated. On a read,
                                                                                    the current interrupt (highest
                                                                                    priority) is automatically cleared by
                                                                                    the hardware and the corresponding
                                                                                    interrupt flag in [RIS] and [MIS] are
                                                                                    cleared as well. After a read from
                                                                                    the CPU (not from the debug
                                                                                    interface), the register is updated
                                                                                    with the next highest priority
                                                                                    interrupt, if none are pending, then
                                                                                    it should display 0x0. */

/* SHAW_SHAW_PUB0_IIDX_1 Bits */
/* SHAW_SHAW_PUB0_IIDX_1[STAT] Bits */
#define SHAW_SHAW_PUB0_IIDX_1_STAT_OFS           (0)                             /* !< STAT Offset */
#define SHAW_SHAW_PUB0_IIDX_1_STAT_MASK          ((uint32_t)0x00000001U)         /* !< This register provides the highest
                                                                                    priority enabled interrupt index.
                                                                                    Value 0x00 means no event pending.
                                                                                    Interrupt 1 is the highest priority,
                                                                                    IIDX next highest, 4, 8, ... IIDX^31
                                                                                    is the least priority. That is, the
                                                                                    least bit position that is set to 1
                                                                                    denotes the highest priority pending
                                                                                    interrupt. The priority order is
                                                                                    fixed. However, users can implement
                                                                                    their own prioritization schemes
                                                                                    using other registers that expose the
                                                                                    full set of interrupts that have
                                                                                    occurred. On each read, only one
                                                                                    interrupt is indicated. On a read,
                                                                                    the current interrupt (highest
                                                                                    priority) is automatically cleared by
                                                                                    the hardware and the corresponding
                                                                                    interrupt flag in [RIS] and [MIS] are
                                                                                    cleared as well. After a read from
                                                                                    the CPU (not from the debug
                                                                                    interface), the register is updated
                                                                                    with the next highest priority
                                                                                    interrupt, if none are pending, then
                                                                                    it should display 0x0. */

/* SHAW_SHAW_PUB0_IMASK Bits */
/* SHAW_SHAW_PUB0_IMASK[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_IMASK_OUTPUTRDY_OFS       (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_IMASK_OUTPUTRDY_MASK      ((uint32_t)0x00000001U)         /* !< Interrupt Mask. If a bit is set,
                                                                                    then corresponding interrupt is
                                                                                    un-masked. Un-masking the interrupt
                                                                                    causes the raw interrupt to be
                                                                                    visible in IIDX, as well as MIS. */

