TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_SHAW_PUB0_IMASK_1 Bits */
/* SHAW_SHAW_PUB0_IMASK_1[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_IMASK_1_OUTPUTRDY_OFS     (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_IMASK_1_OUTPUTRDY_MASK    ((uint32_t)0x00000001U)         /* !< Interrupt Mask. If a bit is set,
                                                                                    then corresponding interrupt is
                                                                                    un-masked. Un-masking the interrupt
                                                                                    causes the raw interrupt to be
                                                                                    visible in IIDX, as well as MIS. */

/* SHAW_SHAW_PUB0_RIS Bits */
/* SHAW_SHAW_PUB0_RIS[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_RIS_OUTPUTRDY_OFS         (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_RIS_OUTPUTRDY_MASK        ((uint32_t)0x00000001U)         /* !< Raw interrupt status. Reflects all
                                                                                    pending interrupts, regardless of
                                                                                    masking. The RIS register allows the
                                                                                    user to implement a poll scheme. A
                                                                                    flag set in this register can be
                                                                                    cleared by writing 1 to the ICLR
                                                                                    register bit even if the
                                                                                    corresponding IMASK bit is not
                                                                                    enabled. */

/* SHAW_SHAW_PUB0_RIS_1 Bits */
/* SHAW_SHAW_PUB0_RIS_1[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_RIS_1_OUTPUTRDY_OFS       (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_RIS_1_OUTPUTRDY_MASK      ((uint32_t)0x00000001U)         /* !< Raw interrupt status. Reflects all
                                                                                    pending interrupts, regardless of
                                                                                    masking. The RIS register allows the
                                                                                    user to implement a poll scheme. A
                                                                                    flag set in this register can be
                                                                                    cleared by writing 1 to the ICLR
                                                                                    register bit even if the
                                                                                    corresponding IMASK bit is not
                                                                                    enabled. */

/* SHAW_SHAW_PUB0_MIS Bits */
/* SHAW_SHAW_PUB0_MIS[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_MIS_OUTPUTRDY_OFS         (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_MIS_OUTPUTRDY_MASK        ((uint32_t)0x00000001U)         /* !< Masked interrupt status. This is an
                                                                                    AND of the IMASK and RIS registers. */

/* SHAW_SHAW_PUB0_MIS_1 Bits */
/* SHAW_SHAW_PUB0_MIS_1[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_MIS_1_OUTPUTRDY_OFS       (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_MIS_1_OUTPUTRDY_MASK      ((uint32_t)0x00000001U)         /* !< Masked interrupt status. This is an
                                                                                    AND of the IMASK and RIS registers. */

/* SHAW_SHAW_PUB0_ISET Bits */
/* SHAW_SHAW_PUB0_ISET[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_ISET_OUTPUTRDY_OFS        (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_ISET_OUTPUTRDY_MASK       ((uint32_t)0x00000001U)         /* !< Interrupt set. Allows interrupts to
                                                                                    be set by software (useful in
                                                                                    diagnostics and safety checks).
                                                                                    Writing a 1 to a bit in ISET will set
                                                                                    the event and therefore the related
                                                                                    RIS bit also gets set. If the
                                                                                    interrupt is enabled through the
                                                                                    mask, then the corresponding MIS bit
                                                                                    is also set. */

/* SHAW_SHAW_PUB0_ISET_1 Bits */
/* SHAW_SHAW_PUB0_ISET_1[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_ISET_1_OUTPUTRDY_OFS      (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_ISET_1_OUTPUTRDY_MASK     ((uint32_t)0x00000001U)         /* !< Interrupt set. Allows interrupts to
                                                                                    be set by software (useful in
                                                                                    diagnostics and safety checks).
                                                                                    Writing a 1 to a bit in ISET will set
                                                                                    the event and therefore the related
                                                                                    RIS bit also gets set. If the
                                                                                    interrupt is enabled through the
                                                                                    mask, then the corresponding MIS bit
                                                                                    is also set. */

/* SHAW_SHAW_PUB0_ICLR Bits */
/* SHAW_SHAW_PUB0_ICLR[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_ICLR_OUTPUTRDY_OFS        (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_ICLR_OUTPUTRDY_MASK       ((uint32_t)0x00000001U)         /* !< Interrupt clear. Write a 1 to clear
                                                                                    corresponding Interrupt. */

/* SHAW_SHAW_PUB0_ICLR_1 Bits */
/* SHAW_SHAW_PUB0_ICLR_1[OUTPUTRDY] Bits */
#define SHAW_SHAW_PUB0_ICLR_1_OUTPUTRDY_OFS      (0)                             /* !< OUTPUTRDY Offset */
#define SHAW_SHAW_PUB0_ICLR_1_OUTPUTRDY_MASK     ((uint32_t)0x00000001U)         /* !< Interrupt clear. Write a 1 to clear
                                                                                    corresponding Interrupt. */

/* SHAW_SHAW_PUB1_IIDX Bits */
/* SHAW_SHAW_PUB1_IIDX[STAT] Bits */
#define SHAW_SHAW_PUB1_IIDX_STAT_OFS             (0)                             /* !< STAT Offset */
#define SHAW_SHAW_PUB1_IIDX_STAT_MASK            ((uint32_t)0x00000001U)         /* !< This register provides the highest
                                                                                    priority enabled interrupt index.
                                                                                    Value 0x00 means no event pending.
                                                                                    Interrupt 1 is the highest priority,
                                                                                    IIDX next highest, 4, 8, ... IIDX^31
                                                                                    is the least priority. That is, the
                                                                                    least bit position that is set to 1
                                                                                    denotes the highest priority pending
                                                                                    interrupt. The priority order is
                                                                                    fixed. However, users can implement
                                                                                    their own prioritization schemes
                                                                                    using other registers that expose the
                                                                                    full set of interrupts that have
                                                                                    occurred. On each read, only one
                                                                                    interrupt is indicated. On a read,
                                                                                    the current interrupt (highest
                                                                                    priority) is automatically cleared by
                                                                                    the hardware and the corresponding
                                                                                    interrupt flag in [RIS] and [MIS] are
                                                                                    cleared as well. After a read from
                                                                                    the CPU (not from the debug
                                                                                    interface), the register is updated
                                                                                    with the next highest priority
                                                                                    interrupt, if none are pending, then
                                                                                    it should display 0x0. */

/* SHAW_SHAW_PUB1_IIDX_1 Bits */
/* SHAW_SHAW_PUB1_IIDX_1[STAT] Bits */
#define SHAW_SHAW_PUB1_IIDX_1_STAT_OFS           (0)                             /* !< STAT Offset */
#define SHAW_SHAW_PUB1_IIDX_1_STAT_MASK          ((uint32_t)0x00000001U)         /* !< This register provides the highest
                                                                                    priority enabled interrupt index.
                                                                                    Value 0x00 means no event pending.
                                                                                    Interrupt 1 is the highest priority,
                                                                                    IIDX next highest, 4, 8, ... IIDX^31
                                                                                    is the least priority. That is, the
                                                                                    least bit position that is set to 1
                                                                                    denotes the highest priority pending
                                                                                    interrupt. The priority order is
                                                                                    fixed. However, users can implement
                                                                                    their own prioritization schemes
                                                                                    using other registers that expose the
                                                                                    full set of interrupts that have
                                                                                    occurred. On each read, only one
                                                                                    interrupt is indicated. On a read,
                                                                                    the current interrupt (highest
                                                                                    priority) is automatically cleared by
                                                                                    the hardware and the corresponding
                                                                                    interrupt flag in [RIS] and [MIS] are
                                                                                    cleared as well. After a read from
                                                                                    the CPU (not from the debug
                                                                                    interface), the register is updated
                                                                                    with the next highest priority
                                                                                    interrupt, if none are pending, then
                                                                                    it should display 0x0. */

/* SHAW_SHAW_PUB1_IMASK Bits */
/* SHAW_SHAW_PUB1_IMASK[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_IMASK_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_IMASK_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt Mask. If a bit is set,
                                                                                    then corresponding interrupt is
                                                                                    un-masked. Un-masking the interrupt
                                                                                    causes the raw interrupt to be
                                                                                    visible in IIDX, as well as MIS. */

/* SHAW_SHAW_PUB1_IMASK_1 Bits */
/* SHAW_SHAW_PUB1_IMASK_1[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_IMASK_1_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_IMASK_1_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt Mask. If a bit is set,
                                                                                    then corresponding interrupt is
                                                                                    un-masked. Un-masking the interrupt
                                                                                    causes the raw interrupt to be
                                                                                    visible in IIDX, as well as MIS. */

/* SHAW_SHAW_PUB1_RIS Bits */
/* SHAW_SHAW_PUB1_RIS[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_RIS_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_RIS_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Raw interrupt status. Reflects all
                                                                                    pending interrupts, regardless of
                                                                                    masking. The RIS register allows the
                                                                                    user to implement a poll scheme. A
                                                                                    flag set in this register can be
                                                                                    cleared by writing 1 to the ICLR
                                                                                    register bit even if the
                                                                                    corresponding IMASK bit is not
                                                                                    enabled. */

/* SHAW_SHAW_PUB1_RIS_1 Bits */
/* SHAW_SHAW_PUB1_RIS_1[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_RIS_1_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_RIS_1_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Raw interrupt status. Reflects all
                                                                                    pending interrupts, regardless of
                                                                                    masking. The RIS register allows the
                                                                                    user to implement a poll scheme. A
                                                                                    flag set in this register can be
                                                                                    cleared by writing 1 to the ICLR
                                                                                    register bit even if the
                                                                                    corresponding IMASK bit is not
                                                                                    enabled. */

