TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_SHAW_PUB1_MIS Bits */
/* SHAW_SHAW_PUB1_MIS[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_MIS_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_MIS_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Masked interrupt status. This is an
                                                                                    AND of the IMASK and RIS registers. */

/* SHAW_SHAW_PUB1_MIS_1 Bits */
/* SHAW_SHAW_PUB1_MIS_1[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_MIS_1_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_MIS_1_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Masked interrupt status. This is an
                                                                                    AND of the IMASK and RIS registers. */

/* SHAW_SHAW_PUB1_ISET Bits */
/* SHAW_SHAW_PUB1_ISET[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_ISET_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_ISET_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt set. Allows interrupts to
                                                                                    be set by software (useful in
                                                                                    diagnostics and safety checks).
                                                                                    Writing a 1 to a bit in ISET will set
                                                                                    the event and therefore the related
                                                                                    RIS bit also gets set. If the
                                                                                    interrupt is enabled through the
                                                                                    mask, then the corresponding MIS bit
                                                                                    is also set. */

/* SHAW_SHAW_PUB1_ISET_1 Bits */
/* SHAW_SHAW_PUB1_ISET_1[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_ISET_1_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_ISET_1_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt set. Allows interrupts to
                                                                                    be set by software (useful in
                                                                                    diagnostics and safety checks).
                                                                                    Writing a 1 to a bit in ISET will set
                                                                                    the event and therefore the related
                                                                                    RIS bit also gets set. If the
                                                                                    interrupt is enabled through the
                                                                                    mask, then the corresponding MIS bit
                                                                                    is also set. */

/* SHAW_SHAW_PUB1_ICLR Bits */
/* SHAW_SHAW_PUB1_ICLR[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_ICLR_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_ICLR_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt clear. Write a 1 to clear
                                                                                    corresponding Interrupt. */

/* SHAW_SHAW_PUB1_ICLR_1 Bits */
/* SHAW_SHAW_PUB1_ICLR_1[DMA_START_TRIGGER] Bits */
#define SHAW_SHAW_PUB1_ICLR_1_DMA_START_TRIGGER_OFS (0)                             /* !< DMA_START_TRIGGER Offset */
#define SHAW_SHAW_PUB1_ICLR_1_DMA_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Interrupt clear. Write a 1 to clear
                                                                                    corresponding Interrupt. */

/* SHAW_SHAW_DMA_START_TRIGGER Bits */
/* SHAW_SHAW_DMA_START_TRIGGER[START_TRIGGER] Bits */
#define SHAW_SHAW_DMA_START_TRIGGER_START_TRIGGER_OFS (0)                             /* !< START_TRIGGER Offset */
#define SHAW_SHAW_DMA_START_TRIGGER_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Trigger to start DMA */

/* SHAW_SHAW_DMA_START_TRIGGER_1 Bits */
/* SHAW_SHAW_DMA_START_TRIGGER_1[START_TRIGGER] Bits */
#define SHAW_SHAW_DMA_START_TRIGGER_1_START_TRIGGER_OFS (0)                             /* !< START_TRIGGER Offset */
#define SHAW_SHAW_DMA_START_TRIGGER_1_START_TRIGGER_MASK ((uint32_t)0x00000001U)         /* !< Trigger to start DMA */

/* SHAW_SHAW_DATA_FIXED Bits */
/* SHAW_SHAW_DATA_FIXED[DATA_IN] Bits */
#define SHAW_SHAW_DATA_FIXED_DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_SHAW_DATA_FIXED_DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_SHAW_DATA_FIXED_1 Bits */
/* SHAW_SHAW_DATA_FIXED_1[DATA_IN] Bits */
#define SHAW_SHAW_DATA_FIXED_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_SHAW_DATA_FIXED_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN0_ Bits */
/* SHAW_EIP59_DATA_IN0_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN0__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN0__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN0_1 Bits */
/* SHAW_EIP59_DATA_IN0_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN0_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN0_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN1_ Bits */
/* SHAW_EIP59_DATA_IN1_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN1__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN1__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN1_1 Bits */
/* SHAW_EIP59_DATA_IN1_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN1_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN1_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN2_ Bits */
/* SHAW_EIP59_DATA_IN2_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN2__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN2__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

