TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_DATA_IN2_1 Bits */
/* SHAW_EIP59_DATA_IN2_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN2_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN2_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN3_ Bits */
/* SHAW_EIP59_DATA_IN3_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN3__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN3__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN3_1 Bits */
/* SHAW_EIP59_DATA_IN3_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN3_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN3_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN4_ Bits */
/* SHAW_EIP59_DATA_IN4_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN4__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN4__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN4_1 Bits */
/* SHAW_EIP59_DATA_IN4_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN4_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN4_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN5_ Bits */
/* SHAW_EIP59_DATA_IN5_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN5__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN5__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN5_1 Bits */
/* SHAW_EIP59_DATA_IN5_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN5_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN5_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN6_ Bits */
/* SHAW_EIP59_DATA_IN6_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN6__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN6__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN6_1 Bits */
/* SHAW_EIP59_DATA_IN6_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN6_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN6_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN7_ Bits */
/* SHAW_EIP59_DATA_IN7_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN7__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN7__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN7_1 Bits */
/* SHAW_EIP59_DATA_IN7_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN7_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN7_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN8_ Bits */
/* SHAW_EIP59_DATA_IN8_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN8__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN8__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN8_1 Bits */
/* SHAW_EIP59_DATA_IN8_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN8_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN8_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN9_ Bits */
/* SHAW_EIP59_DATA_IN9_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN9__DATA_IN_OFS         (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN9__DATA_IN_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN9_1 Bits */
/* SHAW_EIP59_DATA_IN9_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN9_1_DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN9_1_DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN10_ Bits */
/* SHAW_EIP59_DATA_IN10_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN10__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN10__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN10_1 Bits */
/* SHAW_EIP59_DATA_IN10_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN10_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN10_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

