TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_DATA_IN11_ Bits */
/* SHAW_EIP59_DATA_IN11_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN11__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN11__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN11_1 Bits */
/* SHAW_EIP59_DATA_IN11_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN11_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN11_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN12_ Bits */
/* SHAW_EIP59_DATA_IN12_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN12__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN12__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN12_1 Bits */
/* SHAW_EIP59_DATA_IN12_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN12_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN12_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN13_ Bits */
/* SHAW_EIP59_DATA_IN13_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN13__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN13__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN13_1 Bits */
/* SHAW_EIP59_DATA_IN13_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN13_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN13_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN14_ Bits */
/* SHAW_EIP59_DATA_IN14_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN14__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN14__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN14_1 Bits */
/* SHAW_EIP59_DATA_IN14_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN14_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN14_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN15_ Bits */
/* SHAW_EIP59_DATA_IN15_[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN15__DATA_IN_OFS        (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN15__DATA_IN_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_DATA_IN15_1 Bits */
/* SHAW_EIP59_DATA_IN15_1[DATA_IN] Bits */
#define SHAW_EIP59_DATA_IN15_1_DATA_IN_OFS       (0)                             /* !< DATA_IN Offset */
#define SHAW_EIP59_DATA_IN15_1_DATA_IN_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Input Data on which hash is
                                                                                    computed */

/* SHAW_EIP59_IO_BUF_CTRL_STAT Bits */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[OUTBUF_FULL] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_OUTBUF_FULL_OFS (0)                             /* !< OUTBUF_FULL Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_OUTBUF_FULL_MASK ((uint32_t)0x00000001U)         /* !< Indicates output is available,
                                                                                    needs to be written 1 to clear this
                                                                                    bit before starting new hash */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[DATA_IN_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_DATA_IN_AV_OFS (1)                             /* !< DATA_IN_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_DATA_IN_AV_MASK ((uint32_t)0x00000002U)         /* !< Indicates that the EIP59_DATA_IN_x
                                                                                    registers contain a new input data
                                                                                    block for processing. #br#The Host
                                                                                    must write a 1b to this bit to start
                                                                                    an operation on the data in
                                                                                    EIP59_DATA_IN_x as soon as the EIP-59
                                                                                    engine is ready to process new input
                                                                                    data. #br#Alternatively, when DMA is
                                                                                    selected, asserting input signal
                                                                                    dma_in_clear to 1b must be used
                                                                                    instead to start processing new input
                                                                                    data. As an exception, the data_in_av
                                                                                    bit must only be used to start
                                                                                    processing a zero length message.
                                                                                    #br#Writing a '0' to the data_in_av
                                                                                    bit has no effect. #br#This bit is
                                                                                    automatically cleared (i.e. reads 0b)
                                                                                    when the Wide bus EIP-59 engine has
                                                                                    copied the EIP59_DATA_IN_x contents.
                                                                                    This bit reads as 1b between the time
                                                                                    it was set by the Host and the Wide
                                                                                    bus EIP-59 engine has started
                                                                                    processing the new input block. */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[LENGTH_IN_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_LENGTH_IN_AV_OFS (2)                             /* !< LENGTH_IN_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_LENGTH_IN_AV_MASK ((uint32_t)0x00000004U)         /* !< Write 1 to indicate length is
                                                                                    available */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[MODE_IN_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_MODE_IN_AV_OFS (3)                             /* !< MODE_IN_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_MODE_IN_AV_MASK ((uint32_t)0x00000008U)         /* !< Write 1 to indicate mode is
                                                                                    available */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[IDIGEST_IN_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_IDIGEST_IN_AV_OFS (4)                             /* !< IDIGEST_IN_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_IDIGEST_IN_AV_MASK ((uint32_t)0x00000010U)         /* !< Write 1 to indicate idigest is
                                                                                    available */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[ODIGEST_IN_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_ODIGEST_IN_AV_OFS (5)                             /* !< ODIGEST_IN_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_ODIGEST_IN_AV_MASK ((uint32_t)0x00000020U)         /* !< Write 1 to indicate odigest is
                                                                                    available */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[PAD_MESSAGE] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_PAD_MESSAGE_OFS (6)                             /* !< PAD_MESSAGE Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_PAD_MESSAGE_MASK ((uint32_t)0x00000040U)         /* !< Write 1 to pad the message */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[GET_DIGEST] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_GET_DIGEST_OFS (7)                             /* !< GET_DIGEST Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_GET_DIGEST_MASK ((uint32_t)0x00000080U)         /* !< Write 1 to get the digest on the
                                                                                    digest out registers */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[IDIGEST_OUT_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_IDIGEST_OUT_AV_OFS (12)                            /* !< IDIGEST_OUT_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_IDIGEST_OUT_AV_MASK ((uint32_t)0x00001000U)         /* !< Status to indicate idigest out is
                                                                                    available */
/* SHAW_EIP59_IO_BUF_CTRL_STAT[ODIGEST_OUT_AV] Bits */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_ODIGEST_OUT_AV_OFS (13)                            /* !< ODIGEST_OUT_AV Offset */
#define SHAW_EIP59_IO_BUF_CTRL_STAT_ODIGEST_OUT_AV_MASK ((uint32_t)0x00002000U)         /* !< Status to indicate odigest out is
                                                                                    available */

/* SHAW_EIP59_IOBUF_CTRL_STAT_1 Bits */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[OUTBUF_FULL] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_OUTBUF_FULL_OFS (0)                             /* !< OUTBUF_FULL Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_OUTBUF_FULL_MASK ((uint32_t)0x00000001U)         /* !< Indicates output is available,
                                                                                    needs to be written 1 to clear this
                                                                                    bit before starting new hash */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[DATA_IN_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_DATA_IN_AV_OFS (1)                             /* !< DATA_IN_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_DATA_IN_AV_MASK ((uint32_t)0x00000002U)         /* !< Indicates that the EIP59_DATA_IN_x
                                                                                    registers contain a new input data
                                                                                    block for processing. #br#The Host
                                                                                    must write a 1b to this bit to start
                                                                                    an operation on the data in
                                                                                    EIP59_DATA_IN_x as soon as the EIP-59
                                                                                    engine is ready to process new input
                                                                                    data. #br#Alternatively, when DMA is
                                                                                    selected, asserting input signal
                                                                                    dma_in_clear to 1b must be used
                                                                                    instead to start processing new input
                                                                                    data. As an exception, the data_in_av
                                                                                    bit must only be used to start
                                                                                    processing a zero length message.
                                                                                    #br#Writing a '0' to the data_in_av
                                                                                    bit has no effect. #br#This bit is
                                                                                    automatically cleared (i.e. reads 0b)
                                                                                    when the Wide bus EIP-59 engine has
                                                                                    copied the EIP59_DATA_IN_x contents.
                                                                                    This bit reads as 1b between the time
                                                                                    it was set by the Host and the Wide
                                                                                    bus EIP-59 engine has started
                                                                                    processing the new input block. */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[LENGTH_IN_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_LENGTH_IN_AV_OFS (2)                             /* !< LENGTH_IN_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_LENGTH_IN_AV_MASK ((uint32_t)0x00000004U)         /* !< Write 1 to indicate length is
                                                                                    available */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[MODE_IN_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_MODE_IN_AV_OFS (3)                             /* !< MODE_IN_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_MODE_IN_AV_MASK ((uint32_t)0x00000008U)         /* !< Write 1 to indicate mode is
                                                                                    available */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[IDIGEST_IN_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_IDIGEST_IN_AV_OFS (4)                             /* !< IDIGEST_IN_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_IDIGEST_IN_AV_MASK ((uint32_t)0x00000010U)         /* !< Write 1 to indicate idigest is
                                                                                    available */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[ODIGEST_IN_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_ODIGEST_IN_AV_OFS (5)                             /* !< ODIGEST_IN_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_ODIGEST_IN_AV_MASK ((uint32_t)0x00000020U)         /* !< Write 1 to indicate odigest is
                                                                                    available */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[PAD_MESSAGE] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_PAD_MESSAGE_OFS (6)                             /* !< PAD_MESSAGE Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_PAD_MESSAGE_MASK ((uint32_t)0x00000040U)         /* !< Write 1 to pad the message */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[GET_DIGEST] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_GET_DIGEST_OFS (7)                             /* !< GET_DIGEST Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_GET_DIGEST_MASK ((uint32_t)0x00000080U)         /* !< Write 1 to get the digest on the
                                                                                    digest out registers */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[IDIGEST_OUT_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_IDIGEST_OUT_AV_OFS (12)                            /* !< IDIGEST_OUT_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_IDIGEST_OUT_AV_MASK ((uint32_t)0x00001000U)         /* !< Status to indicate idigest out is
                                                                                    available */
/* SHAW_EIP59_IOBUF_CTRL_STAT_1[ODIGEST_OUT_AV] Bits */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_ODIGEST_OUT_AV_OFS (13)                            /* !< ODIGEST_OUT_AV Offset */
#define SHAW_EIP59_IOBUF_CTRL_STAT_1_ODIGEST_OUT_AV_MASK ((uint32_t)0x00002000U)         /* !< Status to indicate odigest out is
                                                                                    available */

