TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_MODE_IN Bits */
/* SHAW_EIP59_MODE_IN[HASH_HMAC] Bits */
#define SHAW_EIP59_MODE_IN_HASH_HMAC_OFS         (0)                             /* !< HASH_HMAC Offset */
#define SHAW_EIP59_MODE_IN_HASH_HMAC_MASK        ((uint32_t)0x00000001U)         /* !< Write 1 to indicate if it is hmac
                                                                                    operation */
/* SHAW_EIP59_MODE_IN[MAC_KEY] Bits */
#define SHAW_EIP59_MODE_IN_MAC_KEY_OFS           (1)                             /* !< MAC_KEY Offset */
#define SHAW_EIP59_MODE_IN_MAC_KEY_MASK          ((uint32_t)0x00000002U)         /* !< Write 1 to indicate mac key
                                                                                    computation */
/* SHAW_EIP59_MODE_IN[NEW_HASH] Bits */
#define SHAW_EIP59_MODE_IN_NEW_HASH_OFS          (2)                             /* !< NEW_HASH Offset */
#define SHAW_EIP59_MODE_IN_NEW_HASH_MASK         ((uint32_t)0x00000004U)         /* !< Write 1 to indicate new hash
                                                                                    computation */
/* SHAW_EIP59_MODE_IN[SHA_256] Bits */
#define SHAW_EIP59_MODE_IN_SHA_256_OFS           (5)                             /* !< SHA_256 Offset */
#define SHAW_EIP59_MODE_IN_SHA_256_MASK          ((uint32_t)0x00000020U)         /* !< Write 1 to compute hash in sha 256
                                                                                    mode, while reading back this
                                                                                    information will be available in 3rd
                                                                                    bit instead of 5th bit and 5th bit
                                                                                    remains reserved */
/* SHAW_EIP59_MODE_IN[SHA_224] Bits */
#define SHAW_EIP59_MODE_IN_SHA_224_OFS           (6)                             /* !< SHA_224 Offset */
#define SHAW_EIP59_MODE_IN_SHA_224_MASK          ((uint32_t)0x00000040U)         /* !< Write 1 to compute hash in sha 224
                                                                                    mode, while reading back this
                                                                                    information will be available in 4rd
                                                                                    bit instead of 6th bit and 6th bit
                                                                                    remains reserved */

/* SHAW_EIP59_MODE_IN_1 Bits */
/* SHAW_EIP59_MODE_IN_1[HASH_HMAC] Bits */
#define SHAW_EIP59_MODE_IN_1_HASH_HMAC_OFS       (0)                             /* !< HASH_HMAC Offset */
#define SHAW_EIP59_MODE_IN_1_HASH_HMAC_MASK      ((uint32_t)0x00000001U)         /* !< Write 1 to indicate if it is hmac
                                                                                    operation */
/* SHAW_EIP59_MODE_IN_1[MAC_KEY] Bits */
#define SHAW_EIP59_MODE_IN_1_MAC_KEY_OFS         (1)                             /* !< MAC_KEY Offset */
#define SHAW_EIP59_MODE_IN_1_MAC_KEY_MASK        ((uint32_t)0x00000002U)         /* !< Write 1 to indicate mac key
                                                                                    computation */
/* SHAW_EIP59_MODE_IN_1[NEW_HASH] Bits */
#define SHAW_EIP59_MODE_IN_1_NEW_HASH_OFS        (2)                             /* !< NEW_HASH Offset */
#define SHAW_EIP59_MODE_IN_1_NEW_HASH_MASK       ((uint32_t)0x00000004U)         /* !< Write 1 to indicate new hash
                                                                                    computation */
/* SHAW_EIP59_MODE_IN_1[SHA_256] Bits */
#define SHAW_EIP59_MODE_IN_1_SHA_256_OFS         (5)                             /* !< SHA_256 Offset */
#define SHAW_EIP59_MODE_IN_1_SHA_256_MASK        ((uint32_t)0x00000020U)         /* !< Write 1 to compute hash in sha 256
                                                                                    mode, while reading back this
                                                                                    information will be available in 3rd
                                                                                    bit instead of 5th bit and 5th bit
                                                                                    remains reserved */
/* SHAW_EIP59_MODE_IN_1[SHA_224] Bits */
#define SHAW_EIP59_MODE_IN_1_SHA_224_OFS         (6)                             /* !< SHA_224 Offset */
#define SHAW_EIP59_MODE_IN_1_SHA_224_MASK        ((uint32_t)0x00000040U)         /* !< Write 1 to compute hash in sha 224
                                                                                    mode, while reading back this
                                                                                    information will be available in 4rd
                                                                                    bit instead of 6th bit and 6th bit
                                                                                    remains reserved */

/* SHAW_EIP59_LENGTH_IN_L Bits */
/* SHAW_EIP59_LENGTH_IN_L[LENGTH_LSB] Bits */
#define SHAW_EIP59_LENGTH_IN_L_LENGTH_LSB_OFS    (0)                             /* !< LENGTH_LSB Offset */
#define SHAW_EIP59_LENGTH_IN_L_LENGTH_LSB_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Data Length LSB */

/* SHAW_EIP59_LENGTH_IN_L_1 Bits */
/* SHAW_EIP59_LENGTH_IN_L_1[LENGTH_LSB] Bits */
#define SHAW_EIP59_LENGTH_IN_L_1_LENGTH_LSB_OFS  (0)                             /* !< LENGTH_LSB Offset */
#define SHAW_EIP59_LENGTH_IN_L_1_LENGTH_LSB_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Data Length LSB */

/* SHAW_EIP59_LENGTH_IN_H Bits */
/* SHAW_EIP59_LENGTH_IN_H[LENGTH_MSB] Bits */
#define SHAW_EIP59_LENGTH_IN_H_LENGTH_MSB_OFS    (0)                             /* !< LENGTH_MSB Offset */
#define SHAW_EIP59_LENGTH_IN_H_LENGTH_MSB_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Data Length MSB */

/* SHAW_EIP59_LENGTH_IN_H_1 Bits */
/* SHAW_EIP59_LENGTH_IN_H_1[LENGTH_MSB] Bits */
#define SHAW_EIP59_LENGTH_IN_H_1_LENGTH_MSB_OFS  (0)                             /* !< LENGTH_MSB Offset */
#define SHAW_EIP59_LENGTH_IN_H_1_LENGTH_MSB_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Data Length MSB */

/* SHAW_EIP59_IDIGEST_A Bits */
/* SHAW_EIP59_IDIGEST_A[IDIGEST_A] Bits */
#define SHAW_EIP59_IDIGEST_A_IDIGEST_A_OFS       (0)                             /* !< IDIGEST_A Offset */
#define SHAW_EIP59_IDIGEST_A_IDIGEST_A_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest A */

/* SHAW_EIP59_IDIGEST_A_1 Bits */
/* SHAW_EIP59_IDIGEST_A_1[IDIGEST_A] Bits */
#define SHAW_EIP59_IDIGEST_A_1_IDIGEST_A_OFS     (0)                             /* !< IDIGEST_A Offset */
#define SHAW_EIP59_IDIGEST_A_1_IDIGEST_A_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest A */

