TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_IDIGEST_B Bits */
/* SHAW_EIP59_IDIGEST_B[IDIGEST_B] Bits */
#define SHAW_EIP59_IDIGEST_B_IDIGEST_B_OFS       (0)                             /* !< IDIGEST_B Offset */
#define SHAW_EIP59_IDIGEST_B_IDIGEST_B_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest B */

/* SHAW_EIP59_IDIGEST_B_1 Bits */
/* SHAW_EIP59_IDIGEST_B_1[IDIGEST_B] Bits */
#define SHAW_EIP59_IDIGEST_B_1_IDIGEST_B_OFS     (0)                             /* !< IDIGEST_B Offset */
#define SHAW_EIP59_IDIGEST_B_1_IDIGEST_B_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest B */

/* SHAW_EIP59_IDIGEST_C Bits */
/* SHAW_EIP59_IDIGEST_C[IDIGEST_C] Bits */
#define SHAW_EIP59_IDIGEST_C_IDIGEST_C_OFS       (0)                             /* !< IDIGEST_C Offset */
#define SHAW_EIP59_IDIGEST_C_IDIGEST_C_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest C */

/* SHAW_EIP59_IDIGEST_C_1 Bits */
/* SHAW_EIP59_IDIGEST_C_1[IDIGEST_C] Bits */
#define SHAW_EIP59_IDIGEST_C_1_IDIGEST_C_OFS     (0)                             /* !< IDIGEST_C Offset */
#define SHAW_EIP59_IDIGEST_C_1_IDIGEST_C_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest C */

/* SHAW_EIP59_IDIGEST_D Bits */
/* SHAW_EIP59_IDIGEST_D[IDIGEST_D] Bits */
#define SHAW_EIP59_IDIGEST_D_IDIGEST_D_OFS       (0)                             /* !< IDIGEST_D Offset */
#define SHAW_EIP59_IDIGEST_D_IDIGEST_D_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest D */

/* SHAW_EIP59_IDIGEST_D_1 Bits */
/* SHAW_EIP59_IDIGEST_D_1[IDIGEST_D] Bits */
#define SHAW_EIP59_IDIGEST_D_1_IDIGEST_D_OFS     (0)                             /* !< IDIGEST_D Offset */
#define SHAW_EIP59_IDIGEST_D_1_IDIGEST_D_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest D */

/* SHAW_EIP59_IDIGEST_E Bits */
/* SHAW_EIP59_IDIGEST_E[IDIGEST_E] Bits */
#define SHAW_EIP59_IDIGEST_E_IDIGEST_E_OFS       (0)                             /* !< IDIGEST_E Offset */
#define SHAW_EIP59_IDIGEST_E_IDIGEST_E_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest E */

/* SHAW_EIP59_IDIGEST_E_1 Bits */
/* SHAW_EIP59_IDIGEST_E_1[IDIGEST_E] Bits */
#define SHAW_EIP59_IDIGEST_E_1_IDIGEST_E_OFS     (0)                             /* !< IDIGEST_E Offset */
#define SHAW_EIP59_IDIGEST_E_1_IDIGEST_E_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest E */

/* SHAW_EIP59_IDIGEST_F Bits */
/* SHAW_EIP59_IDIGEST_F[IDIGEST_F] Bits */
#define SHAW_EIP59_IDIGEST_F_IDIGEST_F_OFS       (0)                             /* !< IDIGEST_F Offset */
#define SHAW_EIP59_IDIGEST_F_IDIGEST_F_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest F */

/* SHAW_EIP59_IDIGEST_F_1 Bits */
/* SHAW_EIP59_IDIGEST_F_1[IDIGEST_F] Bits */
#define SHAW_EIP59_IDIGEST_F_1_IDIGEST_F_OFS     (0)                             /* !< IDIGEST_F Offset */
#define SHAW_EIP59_IDIGEST_F_1_IDIGEST_F_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest F */

/* SHAW_EIP59_IDIGEST_G Bits */
/* SHAW_EIP59_IDIGEST_G[IDIGEST_G] Bits */
#define SHAW_EIP59_IDIGEST_G_IDIGEST_G_OFS       (0)                             /* !< IDIGEST_G Offset */
#define SHAW_EIP59_IDIGEST_G_IDIGEST_G_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest G */

/* SHAW_EIP59_IDIGEST_G_1 Bits */
/* SHAW_EIP59_IDIGEST_G_1[IDIGEST_G] Bits */
#define SHAW_EIP59_IDIGEST_G_1_IDIGEST_G_OFS     (0)                             /* !< IDIGEST_G Offset */
#define SHAW_EIP59_IDIGEST_G_1_IDIGEST_G_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest G */

/* SHAW_EIP59_IDIGEST_H Bits */
/* SHAW_EIP59_IDIGEST_H[IDIGEST_H] Bits */
#define SHAW_EIP59_IDIGEST_H_IDIGEST_H_OFS       (0)                             /* !< IDIGEST_H Offset */
#define SHAW_EIP59_IDIGEST_H_IDIGEST_H_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest H */

/* SHAW_EIP59_IDIGEST_H_1 Bits */
/* SHAW_EIP59_IDIGEST_H_1[IDIGEST_H] Bits */
#define SHAW_EIP59_IDIGEST_H_1_IDIGEST_H_OFS     (0)                             /* !< IDIGEST_H Offset */
#define SHAW_EIP59_IDIGEST_H_1_IDIGEST_H_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Inner Digest H */

/* SHAW_EIP59_ODIGEST_A Bits */
/* SHAW_EIP59_ODIGEST_A[ODIGEST_A] Bits */
#define SHAW_EIP59_ODIGEST_A_ODIGEST_A_OFS       (0)                             /* !< ODIGEST_A Offset */
#define SHAW_EIP59_ODIGEST_A_ODIGEST_A_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest A */

/* SHAW_EIP59_ODIGEST_A_1 Bits */
/* SHAW_EIP59_ODIGEST_A_1[ODIGEST_A] Bits */
#define SHAW_EIP59_ODIGEST_A_1_ODIGEST_A_OFS     (0)                             /* !< ODIGEST_A Offset */
#define SHAW_EIP59_ODIGEST_A_1_ODIGEST_A_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest A */

/* SHAW_EIP59_ODIGEST_B Bits */
/* SHAW_EIP59_ODIGEST_B[ODIGEST_B] Bits */
#define SHAW_EIP59_ODIGEST_B_ODIGEST_B_OFS       (0)                             /* !< ODIGEST_B Offset */
#define SHAW_EIP59_ODIGEST_B_ODIGEST_B_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest B */

/* SHAW_EIP59_ODIGEST_B_1 Bits */
/* SHAW_EIP59_ODIGEST_B_1[ODIGEST_B] Bits */
#define SHAW_EIP59_ODIGEST_B_1_ODIGEST_B_OFS     (0)                             /* !< ODIGEST_B Offset */
#define SHAW_EIP59_ODIGEST_B_1_ODIGEST_B_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest B */

/* SHAW_EIP59_ODIGEST_C Bits */
/* SHAW_EIP59_ODIGEST_C[ODIGEST_C] Bits */
#define SHAW_EIP59_ODIGEST_C_ODIGEST_C_OFS       (0)                             /* !< ODIGEST_C Offset */
#define SHAW_EIP59_ODIGEST_C_ODIGEST_C_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest C */

/* SHAW_EIP59_ODIGEST_C_1 Bits */
/* SHAW_EIP59_ODIGEST_C_1[ODIGEST_C] Bits */
#define SHAW_EIP59_ODIGEST_C_1_ODIGEST_C_OFS     (0)                             /* !< ODIGEST_C Offset */
#define SHAW_EIP59_ODIGEST_C_1_ODIGEST_C_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest C */

/* SHAW_EIP59_ODIGEST_D Bits */
/* SHAW_EIP59_ODIGEST_D[ODIGEST_D] Bits */
#define SHAW_EIP59_ODIGEST_D_ODIGEST_D_OFS       (0)                             /* !< ODIGEST_D Offset */
#define SHAW_EIP59_ODIGEST_D_ODIGEST_D_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest D */

/* SHAW_EIP59_ODIGEST_D_1 Bits */
/* SHAW_EIP59_ODIGEST_D_1[ODIGEST_D] Bits */
#define SHAW_EIP59_ODIGEST_D_1_ODIGEST_D_OFS     (0)                             /* !< ODIGEST_D Offset */
#define SHAW_EIP59_ODIGEST_D_1_ODIGEST_D_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest D */

/* SHAW_EIP59_ODIGEST_E Bits */
/* SHAW_EIP59_ODIGEST_E[ODIGEST_E] Bits */
#define SHAW_EIP59_ODIGEST_E_ODIGEST_E_OFS       (0)                             /* !< ODIGEST_E Offset */
#define SHAW_EIP59_ODIGEST_E_ODIGEST_E_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest E */

/* SHAW_EIP59_ODIGEST_E_1 Bits */
/* SHAW_EIP59_ODIGEST_E_1[ODIGEST_E] Bits */
#define SHAW_EIP59_ODIGEST_E_1_ODIGEST_E_OFS     (0)                             /* !< ODIGEST_E Offset */
#define SHAW_EIP59_ODIGEST_E_1_ODIGEST_E_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest E */

