TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_ODIGEST_F Bits */
/* SHAW_EIP59_ODIGEST_F[ODIGEST_F] Bits */
#define SHAW_EIP59_ODIGEST_F_ODIGEST_F_OFS       (0)                             /* !< ODIGEST_F Offset */
#define SHAW_EIP59_ODIGEST_F_ODIGEST_F_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest F */

/* SHAW_EIP59_ODIGEST_F_1 Bits */
/* SHAW_EIP59_ODIGEST_F_1[ODIGEST_F] Bits */
#define SHAW_EIP59_ODIGEST_F_1_ODIGEST_F_OFS     (0)                             /* !< ODIGEST_F Offset */
#define SHAW_EIP59_ODIGEST_F_1_ODIGEST_F_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest F */

/* SHAW_EIP59_ODIGEST_G Bits */
/* SHAW_EIP59_ODIGEST_G[ODIGEST_G] Bits */
#define SHAW_EIP59_ODIGEST_G_ODIGEST_G_OFS       (0)                             /* !< ODIGEST_G Offset */
#define SHAW_EIP59_ODIGEST_G_ODIGEST_G_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest G */

/* SHAW_EIP59_ODIGEST_G_1 Bits */
/* SHAW_EIP59_ODIGEST_G_1[ODIGEST_G] Bits */
#define SHAW_EIP59_ODIGEST_G_1_ODIGEST_G_OFS     (0)                             /* !< ODIGEST_G Offset */
#define SHAW_EIP59_ODIGEST_G_1_ODIGEST_G_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest G */

/* SHAW_EIP59_ODIGEST_H Bits */
/* SHAW_EIP59_ODIGEST_H[ODIGEST_H] Bits */
#define SHAW_EIP59_ODIGEST_H_ODIGEST_H_OFS       (0)                             /* !< ODIGEST_H Offset */
#define SHAW_EIP59_ODIGEST_H_ODIGEST_H_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest H */

/* SHAW_EIP59_ODIGEST_H_1 Bits */
/* SHAW_EIP59_ODIGEST_H_1[ODIGEST_H] Bits */
#define SHAW_EIP59_ODIGEST_H_1_ODIGEST_H_OFS     (0)                             /* !< ODIGEST_H Offset */
#define SHAW_EIP59_ODIGEST_H_1_ODIGEST_H_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Outer Digest H */

/* SHAW_EIP59_DIGEST_A Bits */
/* SHAW_EIP59_DIGEST_A[DIGEST_A] Bits */
#define SHAW_EIP59_DIGEST_A_DIGEST_A_OFS         (0)                             /* !< DIGEST_A Offset */
#define SHAW_EIP59_DIGEST_A_DIGEST_A_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output A */

/* SHAW_EIP59_DIGEST_A_1 Bits */
/* SHAW_EIP59_DIGEST_A_1[DIGEST_A] Bits */
#define SHAW_EIP59_DIGEST_A_1_DIGEST_A_OFS       (0)                             /* !< DIGEST_A Offset */
#define SHAW_EIP59_DIGEST_A_1_DIGEST_A_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output A */

/* SHAW_EIP59_DIGEST_B Bits */
/* SHAW_EIP59_DIGEST_B[DIGEST_B] Bits */
#define SHAW_EIP59_DIGEST_B_DIGEST_B_OFS         (0)                             /* !< DIGEST_B Offset */
#define SHAW_EIP59_DIGEST_B_DIGEST_B_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output B */

/* SHAW_EIP59_DIGEST_B_1 Bits */
/* SHAW_EIP59_DIGEST_B_1[DIGEST_B] Bits */
#define SHAW_EIP59_DIGEST_B_1_DIGEST_B_OFS       (0)                             /* !< DIGEST_B Offset */
#define SHAW_EIP59_DIGEST_B_1_DIGEST_B_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output B */

/* SHAW_EIP59_DIGEST_C Bits */
/* SHAW_EIP59_DIGEST_C[DIGEST_C] Bits */
#define SHAW_EIP59_DIGEST_C_DIGEST_C_OFS         (0)                             /* !< DIGEST_C Offset */
#define SHAW_EIP59_DIGEST_C_DIGEST_C_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output C */

/* SHAW_EIP59_DIGEST_C_1 Bits */
/* SHAW_EIP59_DIGEST_C_1[DIGEST_C] Bits */
#define SHAW_EIP59_DIGEST_C_1_DIGEST_C_OFS       (0)                             /* !< DIGEST_C Offset */
#define SHAW_EIP59_DIGEST_C_1_DIGEST_C_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output C */

/* SHAW_EIP59_DIGEST_D Bits */
/* SHAW_EIP59_DIGEST_D[DIGEST_D] Bits */
#define SHAW_EIP59_DIGEST_D_DIGEST_D_OFS         (0)                             /* !< DIGEST_D Offset */
#define SHAW_EIP59_DIGEST_D_DIGEST_D_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output D */

/* SHAW_EIP59_DIGEST_D_1 Bits */
/* SHAW_EIP59_DIGEST_D_1[DIGEST_D] Bits */
#define SHAW_EIP59_DIGEST_D_1_DIGEST_D_OFS       (0)                             /* !< DIGEST_D Offset */
#define SHAW_EIP59_DIGEST_D_1_DIGEST_D_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output D */

/* SHAW_EIP59_DIGEST_E Bits */
/* SHAW_EIP59_DIGEST_E[DIGEST_E] Bits */
#define SHAW_EIP59_DIGEST_E_DIGEST_E_OFS         (0)                             /* !< DIGEST_E Offset */
#define SHAW_EIP59_DIGEST_E_DIGEST_E_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output E */

/* SHAW_EIP59_DIGEST_E_1 Bits */
/* SHAW_EIP59_DIGEST_E_1[DIGEST_E] Bits */
#define SHAW_EIP59_DIGEST_E_1_DIGEST_E_OFS       (0)                             /* !< DIGEST_E Offset */
#define SHAW_EIP59_DIGEST_E_1_DIGEST_E_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output E */

/* SHAW_EIP59_DIGEST_F Bits */
/* SHAW_EIP59_DIGEST_F[DIGEST_F] Bits */
#define SHAW_EIP59_DIGEST_F_DIGEST_F_OFS         (0)                             /* !< DIGEST_F Offset */
#define SHAW_EIP59_DIGEST_F_DIGEST_F_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output F */

/* SHAW_EIP59_DIGEST_F_1 Bits */
/* SHAW_EIP59_DIGEST_F_1[DIGEST_F] Bits */
#define SHAW_EIP59_DIGEST_F_1_DIGEST_F_OFS       (0)                             /* !< DIGEST_F Offset */
#define SHAW_EIP59_DIGEST_F_1_DIGEST_F_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output F */

/* SHAW_EIP59_DIGEST_G Bits */
/* SHAW_EIP59_DIGEST_G[DIGEST_G] Bits */
#define SHAW_EIP59_DIGEST_G_DIGEST_G_OFS         (0)                             /* !< DIGEST_G Offset */
#define SHAW_EIP59_DIGEST_G_DIGEST_G_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output G */

/* SHAW_EIP59_DIGEST_G_1 Bits */
/* SHAW_EIP59_DIGEST_G_1[DIGEST_G] Bits */
#define SHAW_EIP59_DIGEST_G_1_DIGEST_G_OFS       (0)                             /* !< DIGEST_G Offset */
#define SHAW_EIP59_DIGEST_G_1_DIGEST_G_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output G */

/* SHAW_EIP59_DIGEST_H Bits */
/* SHAW_EIP59_DIGEST_H[DIGEST_H] Bits */
#define SHAW_EIP59_DIGEST_H_DIGEST_H_OFS         (0)                             /* !< DIGEST_H Offset */
#define SHAW_EIP59_DIGEST_H_DIGEST_H_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output H */

