TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_shaw.h
/* SHAW_EIP59_DIGEST_H_1 Bits */
/* SHAW_EIP59_DIGEST_H_1[DIGEST_H] Bits */
#define SHAW_EIP59_DIGEST_H_1_DIGEST_H_OFS       (0)                             /* !< DIGEST_H Offset */
#define SHAW_EIP59_DIGEST_H_1_DIGEST_H_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Digest Output H */

/* SHAW_EIP59_CONFIG Bits */
/* SHAW_EIP59_CONFIG[CONFIG] Bits */
#define SHAW_EIP59_CONFIG_CONFIG_OFS             (0)                             /* !< CONFIG Offset */
#define SHAW_EIP59_CONFIG_CONFIG_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Configuration Register = 0x01400019 */

/* SHAW_EIP59_CONFIG_1 Bits */
/* SHAW_EIP59_CONFIG_1[CONFIG] Bits */
#define SHAW_EIP59_CONFIG_1_CONFIG_OFS           (0)                             /* !< CONFIG Offset */
#define SHAW_EIP59_CONFIG_1_CONFIG_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< Configuration Register = 0x01400019 */

/* SHAW_EIP59_VERSION Bits */
/* SHAW_EIP59_VERSION[VERSION] Bits */
#define SHAW_EIP59_VERSION_VERSION_OFS           (0)                             /* !< VERSION Offset */
#define SHAW_EIP59_VERSION_VERSION_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< Version Register = 0x2240C43B */

/* SHAW_EIP59_VERSION_1 Bits */
/* SHAW_EIP59_VERSION_1[VERSION] Bits */
#define SHAW_EIP59_VERSION_1_VERSION_OFS         (0)                             /* !< VERSION Offset */
#define SHAW_EIP59_VERSION_1_VERSION_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Version Register = 0x2240C43B */

/* SHAW_PWREN Bits */
/* SHAW_PWREN[ENABLE] Bits */
#define SHAW_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define SHAW_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power */
#define SHAW_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define SHAW_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* SHAW_PWREN[KEY] Bits */
#define SHAW_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define SHAW_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define SHAW_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* SHAW_RSTCTL Bits */
/* SHAW_RSTCTL[RESETSTKYCLR] Bits */
#define SHAW_RSTCTL_RESETSTKYCLR_OFS             (1)                             /* !< RESETSTKYCLR Offset */
#define SHAW_RSTCTL_RESETSTKYCLR_MASK            ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define SHAW_RSTCTL_RESETSTKYCLR_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SHAW_RSTCTL_RESETSTKYCLR_CLR             ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* SHAW_RSTCTL[RESETASSERT] Bits */
#define SHAW_RSTCTL_RESETASSERT_OFS              (0)                             /* !< RESETASSERT Offset */
#define SHAW_RSTCTL_RESETASSERT_MASK             ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define SHAW_RSTCTL_RESETASSERT_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SHAW_RSTCTL_RESETASSERT_ASSERT           ((uint32_t)0x00000001U)         /* !< Assert reset */
/* SHAW_RSTCTL[KEY] Bits */
#define SHAW_RSTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define SHAW_RSTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define SHAW_RSTCTL_KEY_UNLOCK_W                 ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* SHAW_STAT Bits */
/* SHAW_STAT[RESETSTKY] Bits */
#define SHAW_STAT_RESETSTKY_OFS                  (16)                            /* !< RESETSTKY Offset */
#define SHAW_STAT_RESETSTKY_MASK                 ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define SHAW_STAT_RESETSTKY_NORES                ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define SHAW_STAT_RESETSTKY_RESET                ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_shaw__include */

